"""
1. Спишіть варіант коду програми вище. Доповніть її гілкою else, обробіть випадки,
коли користувач вводить числа, які не входять в задані чотири діапазони.
Подумайте, чому в першій версії програми (коли використовувалися не пов'язані
один з одним умовні оператори) не можна було використовувати else, а для
обробки таких, що не входять в діапазони, випадків довелося б писати ще один
if?

"""

old = int(input("Ваш вік(від 3):"))
print('Рекомендовано:', end='')
if 3 <= old < 6:
    print('"Заєць в лабіринті"')
elif 6 <= old < 12:
    print('"Марсіанин"')
elif 12 <= old < 16:
    print('"Загадковий острів"')
elif 16 <= old:
    print('"Потік свідомості"')
else:
    print("Неправильно введено вік.")