"""
1. Змініть код так, щоб змінна total не могла піти в мінус. Наприклад, після
попередніх вирахувань її значення стало рівним 25. Користувач вводить число
30. Однак програма не виконує віднімання, а виводить повідомлення про
неприпустимість операції, після чого здійснює вихід з циклу.
"""

total = 100

while total > 0:
    n = int(input())
    if total - n >= 0:
        total = total - n
        print(total)
    else:
        print("Операція неприпустима.")
        break
print("Ресурс вичерпано.")
