"""
У програмуванні можна з однієї функції викликати іншу. Для ілюстрації цієї можливості
напишіть програму за наступним описом.
Основна гілка програми, не рахуючи заголовків функцій, складається з одного рядка
коду. Це виклик функції test(). У ній організуйте введення цілого числа. Якщо воно
більше нуля, то викликається функція positive(), тіло якої містить команду виведення на
екран слова "Позитивне";. Якщо число від`ємне, то викликається функція negative(), її
тіло містить вираз виведення на екран слова "Негативне".
Зрозуміло, що виклик test() повинен слідувати після визначення функцій. Однак чи має
значення порядок визначення самих функцій? Тобто чи повинні визначення positive() і
negative() передувати test() або можуть слідувати після нього? Перевірте вашу гіпотезу,
помінявши оголошення функцій місцями. Спробуйте пояснити результат.
"""


def test():
    try:
        a = float(input("Num:"))
        if a > 0:
            positive()
        elif a < 0:
            negative()
    except ValueError:
        print("Wrong input.")


def positive():
    print("Позитивне.")


def negative():
    print("Негативне.")


test()
