"""
У мові Python можна всередині однієї функції визначати іншу. Напишіть програму за
наступним описом.

В основній гілці програми викликається функція cylinder(), яка обчислює площу
циліндра. У тілі cylinder визначена функція circle, що обчислює площу круга за
формулою π*r 2 . У тілі cylinder у користувача запитують, чи хоче він отримати тільки
площу бічної поверхні циліндра, яка обчислюється за формулою 2*π*r*h, або повну
площу циліндра. В останньому випадку до площі бічної поверхні циліндра повинен
додаватися подвоєний результат обчислень функції circle().
Як ви думаєте, чи можна з основної гілки програми викликати функцію, вкладену в іншу
функцію? Чому?
"""

from math import pi


def cylinder(r, h):
    def circle(r):
        return pi*r*r
    while True:
        try:
            response = int(input("Що хочете отримати?(1 - площа бічної поверхні, 2 - повна площа):"))
            break
        except ValueError:
            print("Неправильно введено. Спробуйте ще раз.")
    if response == 1:
        return 2*pi*r*h
    elif response == 2:
        return 2*pi*r*h+2*circle(r)


try:
    r = float(input("Радіус:"))
    h = float(input("Висота:"))
    print(cylinder(r, h))
except ValueError:
    print("Wrong input.")

